Ran Plan for dir: `infrastructure` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.prod.module.postgresql.aws_rds_cluster.default has changed
~ resource "aws_rds_cluster" "default" {
      ~ engine_version                        = "13.18" -> "13.20"
      ~ engine_version_actual                 = "13.18" -> "13.20"
        id                                    = "jfp-core-prod"
        tags                                  = {}
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.stage.module.postgresql.aws_rds_cluster.default has changed
~ resource "aws_rds_cluster" "default" {
      ~ engine_version                        = "13.18" -> "13.20"
      ~ engine_version_actual                 = "13.18" -> "13.20"
        id                                    = "jfp-core-stage"
        tags                                  = {}
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.prod.module.postgresql.aws_rds_cluster.default will be updated in-place
~ resource "aws_rds_cluster" "default" {
      + enable_local_write_forwarding         = false
      ~ engine_version                        = "13.20" -> "13.18"
        id                                    = "jfp-core-prod"
        tags                                  = {}
        # (59 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod.module.postgresql.aws_rds_cluster_instance.default will be updated in-place
~ resource "aws_rds_cluster_instance" "default" {
      ~ engine_version                        = "13.20" -> "13.18"
      + force_destroy                         = false
        id                                    = "tf-20240604195536182300000003"
        tags                                  = {}
        # (32 unchanged attributes hidden)
    }

  # module.stage.module.postgresql.aws_rds_cluster.default will be updated in-place
~ resource "aws_rds_cluster" "default" {
      + enable_local_write_forwarding         = false
      ~ engine_version                        = "13.20" -> "13.18"
        id                                    = "jfp-core-stage"
        tags                                  = {}
        # (59 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.stage.module.postgresql.aws_rds_cluster_instance.default will be updated in-place
~ resource "aws_rds_cluster_instance" "default" {
      ~ engine_version                        = "13.20" -> "13.18"
      + force_destroy                         = false
        id                                    = "tf-20240618004835876400000003"
        tags                                  = {}
        # (32 unchanged attributes hidden)
    }

  # module.prod.module.api-media.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-prod/api-media-prod-service"
        name                               = "api-media-prod-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-media-prod:46" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.prod.module.api-media.module.ecs-task.aws_ecs_task_definition.ecs_task_definition must be replaced
+/- resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-media-prod:46" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-media-prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 1024
                  - environment      = [
                      - {
                          - name  = "AWS_REGION"
                          - value = "us-east-2"
                        },
                      - {
                          - name  = "ECS_CLUSTER"
                          - value = "jfp-ecs-cluster-prod"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "SERVICE_ENV"
                          - value = "prod"
                        },
                      - {
                          - name  = "SERVICE_NAME"
                          - value = "api-media"
                        },
                    ]
                  - essential        = true
                  - image            = "410965620680.dkr.ecr.us-east-2.amazonaws.com/jfp-api-media-prod:latest"
                  - logConfiguration = {
                      - logDriver     = "awsfirelens"
                      - options       = {
                          - Host        = "http-intake.logs.datadoghq.com"
                          - Name        = "datadog"
                          - TLS         = "on"
                          - compress    = "gzip"
                          - dd_service  = "api-media"
                          - dd_source   = "graphql-yoga"
                          - dd_tags     = "env:prod"
                          - provider    = "ecs"
                          - retry_limit = "2"
                        }
                      - secretOptions = [
                          - {
                              - name      = "apikey"
                              - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                            },
                        ]
                    }
                  - memory           = 2048
                  - mountPoints      = []
                  - name             = "jfp-api-media-prod-app"
                  - portMappings     = [
                      - {
                          - containerPort = 4005
                          - hostPort      = 4005
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ALGOLIA_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/ALGOLIA_API_KEY"
                        },
                      - {
                          - name      = "ALGOLIA_APPLICATION_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/ALGOLIA_APPLICATION_ID"
                        },
                      - {
                          - name      = "ALGOLIA_INDEX_VIDEOS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/ALGOLIA_INDEX_VIDEOS"
                        },
                      - {
                          - name      = "ALGOLIA_INDEX_VIDEO_VARIANTS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/ALGOLIA_INDEX_VIDEO_VARIANTS"
                        },
                      - {
                          - name      = "ARCLIGHT_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/ARCLIGHT_API_KEY"
                        },
                      - {
                          - name      = "ARCLIGHT_V3_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/ARCLIGHT_V3_URL"
                        },
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/AWS_ACCESS_KEY_ID"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/AWS_SECRET_ACCESS_KEY"
                        },
                      - {
                          - name      = "CLOUDFLARE_ACCOUNT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CLOUDFLARE_ACCOUNT_ID"
                        },
                      - {
                          - name      = "CLOUDFLARE_IMAGES_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CLOUDFLARE_IMAGES_TOKEN"
                        },
                      - {
                          - name      = "CLOUDFLARE_IMAGE_ACCOUNT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CLOUDFLARE_IMAGE_ACCOUNT"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CLOUDFLARE_R2_ACCESS_KEY_ID"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_BUCKET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CLOUDFLARE_R2_BUCKET"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_CUSTOM_DOMAIN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CLOUDFLARE_R2_CUSTOM_DOMAIN"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_ENDPOINT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CLOUDFLARE_R2_ENDPOINT"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CLOUDFLARE_R2_SECRET"
                        },
                      - {
                          - name      = "CORS_ORIGIN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CORS_ORIGIN"
                        },
                      - {
                          - name      = "CROWDIN_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CROWDIN_API_KEY"
                        },
                      - {
                          - name      = "CROWDIN_DISTRIBUTION_HASH"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CROWDIN_DISTRIBUTION_HASH"
                        },
                      - {
                          - name      = "CROWDIN_PROJECT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/CROWDIN_PROJECT_ID"
                        },
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                      - {
                          - name      = "FIREBASE_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/FIREBASE_API_KEY"
                        },
                      - {
                          - name      = "GATEWAY_HMAC_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/GATEWAY_HMAC_SECRET"
                        },
                      - {
                          - name      = "GATEWAY_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/GATEWAY_URL"
                        },
                      - {
                          - name      = "GOOGLE_APPLICATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/GOOGLE_APPLICATION_JSON"
                        },
                      - {
                          - name      = "INTEROP_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/INTEROP_TOKEN"
                        },
                      - {
                          - name      = "JOURNEYS_SHORTLINK_DOMAIN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/JOURNEYS_SHORTLINK_DOMAIN"
                        },
                      - {
                          - name      = "MUX_ACCESS_TOKEN_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/MUX_ACCESS_TOKEN_ID"
                        },
                      - {
                          - name      = "MUX_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/MUX_SECRET_KEY"
                        },
                      - {
                          - name      = "MUX_UGC_ACCESS_TOKEN_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/MUX_UGC_ACCESS_TOKEN_ID"
                        },
                      - {
                          - name      = "MUX_UGC_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/MUX_UGC_SECRET_KEY"
                        },
                      - {
                          - name      = "NAT_ADDRESSES"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/NAT_ADDRESSES"
                        },
                      - {
                          - name      = "PG_DATABASE_URL_MEDIA"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/PG_DATABASE_URL_MEDIA"
                        },
                      - {
                          - name      = "REDIS_PORT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/REDIS_PORT"
                        },
                      - {
                          - name      = "REDIS_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/REDIS_URL"
                        },
                      - {
                          - name      = "SEGMIND_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/SEGMIND_API_KEY"
                        },
                      - {
                          - name      = "UNSPLASH_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/UNSPLASH_ACCESS_KEY"
                        },
                      - {
                          - name      = "VERCEL_SHORT_LINKS_PROJECT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/VERCEL_SHORT_LINKS_PROJECT_ID"
                        },
                      - {
                          - name      = "VERCEL_TEAM_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/VERCEL_TEAM_ID"
                        },
                      - {
                          - name      = "VERCEL_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/VERCEL_TOKEN"
                        },
                      - {
                          - name      = "WATCH_REVALIDATE_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/WATCH_REVALIDATE_SECRET"
                        },
                      - {
                          - name      = "WATCH_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/prod/WATCH_URL"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - environment       = [
                      - {
                          - name  = "DD_APM_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_APM_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_DOGSTATSD_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_LOGS_INJECTION"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_GRPC_ENDPOINT"
                          - value = "0.0.0.0:4317"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_HTTP_ENDPOINT"
                          - value = "0.0.0.0:4318"
                        },
                      - {
                          - name  = "DD_PROCESS_AGENT_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_PROFILING_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_RUNTIME_METRICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_TAGS"
                          - value = "env:prod app:api-media"
                        },
                      - {
                          - name  = "DD_TRACE_ANALYTICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ECS_FARGATE"
                          - value = "true"
                        },
                    ]
                  - essential         = true
                  - image             = "public.ecr.aws/datadog/agent:latest"
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-media-prod-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation = 128
                  - mountPoints       = []
                  - name              = "jfp-api-media-prod-datadog-agent"
                  - portMappings      = [
                      - {
                          - containerPort = 4317
                          - hostPort      = 4317
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4318
                          - hostPort      = 4318
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 8125
                          - hostPort      = 8125
                          - protocol      = "udp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
              - {
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - config-file-type        = "file"
                          - config-file-value       = "/fluent-bit/configs/parse-json.conf"
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "amazon/aws-for-fluent-bit:stable"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-media-prod-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation     = 100
                  - mountPoints           = []
                  - name                  = "jfp-api-media-prod-log-router"
                  - portMappings          = []
                  - systemControls        = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "jfp-api-media-prod" -> (known after apply)
      ~ revision                 = 46 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.prod.module.api-media.module.ecs-task.aws_ssm_parameter.parameters["MEDIA_TRANSCODER_TASK_DEFINITION"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/api-media/prod/MEDIA_TRANSCODER_TASK_DEFINITION"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "MEDIA_TRANSCODER_TASK_DEFINITION"
        }
      + tags_all       = {
          + "name" = "MEDIA_TRANSCODER_TASK_DEFINITION"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_cloudwatch_log_group.ecs_cw_log_group will be created
+ resource "aws_cloudwatch_log_group" "ecs_cw_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "media-transcoder-prod-logs"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ecr_lifecycle_policy.ecr_policy will be created
+ resource "aws_ecr_lifecycle_policy" "ecr_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire more than 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "jfp-media-transcoder-prod"
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ecr_repository.ecr_repository will be created
+ resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "jfp-media-transcoder-prod"
      + region               = "us-east-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ecs_task_definition.ecs_task_definition will be created
+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::410965620680:role/jfp-ecs-task-execution-role"
      + family                   = "jfp-media-transcoder-prod"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + track_latest             = false
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["CLOUDFLARE_R2_ACCESS_KEY_ID"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/prod/CLOUDFLARE_R2_ACCESS_KEY_ID"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "CLOUDFLARE_R2_ACCESS_KEY_ID"
        }
      + tags_all       = {
          + "name" = "CLOUDFLARE_R2_ACCESS_KEY_ID"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["CLOUDFLARE_R2_BUCKET"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/prod/CLOUDFLARE_R2_BUCKET"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "CLOUDFLARE_R2_BUCKET"
        }
      + tags_all       = {
          + "name" = "CLOUDFLARE_R2_BUCKET"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["CLOUDFLARE_R2_ENDPOINT"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/prod/CLOUDFLARE_R2_ENDPOINT"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "CLOUDFLARE_R2_ENDPOINT"
        }
      + tags_all       = {
          + "name" = "CLOUDFLARE_R2_ENDPOINT"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["CLOUDFLARE_R2_SECRET"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/prod/CLOUDFLARE_R2_SECRET"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "CLOUDFLARE_R2_SECRET"
        }
      + tags_all       = {
          + "name" = "CLOUDFLARE_R2_SECRET"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["REDIS_PORT"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/prod/REDIS_PORT"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "REDIS_PORT"
        }
      + tags_all       = {
          + "name" = "REDIS_PORT"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.prod.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["REDIS_URL"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/prod/REDIS_URL"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "REDIS_URL"
        }
      + tags_all       = {
          + "name" = "REDIS_URL"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.stage.module.api-media.module.ecs-task.aws_ecs_service.ecs_service will be updated in-place
~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-2:410965620680:service/jfp-ecs-cluster-stage/api-media-stage-service"
        name                               = "api-media-stage-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-media-stage:44" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.stage.module.api-media.module.ecs-task.aws_ecs_task_definition.ecs_task_definition must be replaced
+/- resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-media-stage:44" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:410965620680:task-definition/jfp-api-media-stage" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 1024
                  - environment      = [
                      - {
                          - name  = "AWS_REGION"
                          - value = "us-east-2"
                        },
                      - {
                          - name  = "ECS_CLUSTER"
                          - value = "jfp-ecs-cluster-stage"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "SERVICE_ENV"
                          - value = "stage"
                        },
                      - {
                          - name  = "SERVICE_NAME"
                          - value = "api-media"
                        },
                    ]
                  - essential        = true
                  - image            = "410965620680.dkr.ecr.us-east-2.amazonaws.com/jfp-api-media-stage:latest"
                  - logConfiguration = {
                      - logDriver     = "awsfirelens"
                      - options       = {
                          - Host        = "http-intake.logs.datadoghq.com"
                          - Name        = "datadog"
                          - TLS         = "on"
                          - compress    = "gzip"
                          - dd_service  = "api-media"
                          - dd_source   = "graphql-yoga"
                          - dd_tags     = "env:stage"
                          - provider    = "ecs"
                          - retry_limit = "2"
                        }
                      - secretOptions = [
                          - {
                              - name      = "apikey"
                              - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                            },
                        ]
                    }
                  - memory           = 2048
                  - mountPoints      = []
                  - name             = "jfp-api-media-stage-app"
                  - portMappings     = [
                      - {
                          - containerPort = 4005
                          - hostPort      = 4005
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ALGOLIA_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/ALGOLIA_API_KEY"
                        },
                      - {
                          - name      = "ALGOLIA_APPLICATION_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/ALGOLIA_APPLICATION_ID"
                        },
                      - {
                          - name      = "ALGOLIA_INDEX_VIDEOS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/ALGOLIA_INDEX_VIDEOS"
                        },
                      - {
                          - name      = "ALGOLIA_INDEX_VIDEO_VARIANTS"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/ALGOLIA_INDEX_VIDEO_VARIANTS"
                        },
                      - {
                          - name      = "ARCLIGHT_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/ARCLIGHT_API_KEY"
                        },
                      - {
                          - name      = "ARCLIGHT_V3_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/ARCLIGHT_V3_URL"
                        },
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/AWS_ACCESS_KEY_ID"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/AWS_SECRET_ACCESS_KEY"
                        },
                      - {
                          - name      = "CLOUDFLARE_ACCOUNT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CLOUDFLARE_ACCOUNT_ID"
                        },
                      - {
                          - name      = "CLOUDFLARE_IMAGES_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CLOUDFLARE_IMAGES_TOKEN"
                        },
                      - {
                          - name      = "CLOUDFLARE_IMAGE_ACCOUNT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CLOUDFLARE_IMAGE_ACCOUNT"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CLOUDFLARE_R2_ACCESS_KEY_ID"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_BUCKET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CLOUDFLARE_R2_BUCKET"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_CUSTOM_DOMAIN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CLOUDFLARE_R2_CUSTOM_DOMAIN"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_ENDPOINT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CLOUDFLARE_R2_ENDPOINT"
                        },
                      - {
                          - name      = "CLOUDFLARE_R2_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CLOUDFLARE_R2_SECRET"
                        },
                      - {
                          - name      = "CORS_ORIGIN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CORS_ORIGIN"
                        },
                      - {
                          - name      = "CROWDIN_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CROWDIN_API_KEY"
                        },
                      - {
                          - name      = "CROWDIN_DISTRIBUTION_HASH"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CROWDIN_DISTRIBUTION_HASH"
                        },
                      - {
                          - name      = "CROWDIN_PROJECT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/CROWDIN_PROJECT_ID"
                        },
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                      - {
                          - name      = "FIREBASE_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/FIREBASE_API_KEY"
                        },
                      - {
                          - name      = "GATEWAY_HMAC_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/GATEWAY_HMAC_SECRET"
                        },
                      - {
                          - name      = "GATEWAY_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/GATEWAY_URL"
                        },
                      - {
                          - name      = "GOOGLE_APPLICATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/GOOGLE_APPLICATION_JSON"
                        },
                      - {
                          - name      = "INTEROP_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/INTEROP_TOKEN"
                        },
                      - {
                          - name      = "JOURNEYS_SHORTLINK_DOMAIN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/JOURNEYS_SHORTLINK_DOMAIN"
                        },
                      - {
                          - name      = "MUX_ACCESS_TOKEN_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/MUX_ACCESS_TOKEN_ID"
                        },
                      - {
                          - name      = "MUX_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/MUX_SECRET_KEY"
                        },
                      - {
                          - name      = "MUX_UGC_ACCESS_TOKEN_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/MUX_UGC_ACCESS_TOKEN_ID"
                        },
                      - {
                          - name      = "MUX_UGC_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/MUX_UGC_SECRET_KEY"
                        },
                      - {
                          - name      = "NAT_ADDRESSES"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/NAT_ADDRESSES"
                        },
                      - {
                          - name      = "PG_DATABASE_URL_MEDIA"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/PG_DATABASE_URL_MEDIA"
                        },
                      - {
                          - name      = "REDIS_PORT"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/REDIS_PORT"
                        },
                      - {
                          - name      = "REDIS_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/REDIS_URL"
                        },
                      - {
                          - name      = "SEGMIND_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/SEGMIND_API_KEY"
                        },
                      - {
                          - name      = "UNSPLASH_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/UNSPLASH_ACCESS_KEY"
                        },
                      - {
                          - name      = "VERCEL_SHORT_LINKS_PROJECT_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/VERCEL_SHORT_LINKS_PROJECT_ID"
                        },
                      - {
                          - name      = "VERCEL_TEAM_ID"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/VERCEL_TEAM_ID"
                        },
                      - {
                          - name      = "VERCEL_TOKEN"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/VERCEL_TOKEN"
                        },
                      - {
                          - name      = "WATCH_REVALIDATE_SECRET"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/WATCH_REVALIDATE_SECRET"
                        },
                      - {
                          - name      = "WATCH_URL"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/ecs/api-media/stage/WATCH_URL"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - environment       = [
                      - {
                          - name  = "DD_APM_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_APM_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_DOGSTATSD_NON_LOCAL_TRAFFIC"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_LOGS_INJECTION"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_GRPC_ENDPOINT"
                          - value = "0.0.0.0:4317"
                        },
                      - {
                          - name  = "DD_OTLP_CONFIG_RECEIVER_PROTOCOLS_HTTP_ENDPOINT"
                          - value = "0.0.0.0:4318"
                        },
                      - {
                          - name  = "DD_PROCESS_AGENT_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_PROFILING_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_RUNTIME_METRICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_TAGS"
                          - value = "env:stage app:api-media"
                        },
                      - {
                          - name  = "DD_TRACE_ANALYTICS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ECS_FARGATE"
                          - value = "true"
                        },
                    ]
                  - essential         = true
                  - image             = "public.ecr.aws/datadog/agent:latest"
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-media-stage-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation = 128
                  - mountPoints       = []
                  - name              = "jfp-api-media-stage-datadog-agent"
                  - portMappings      = [
                      - {
                          - containerPort = 4317
                          - hostPort      = 4317
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4318
                          - hostPort      = 4318
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 8125
                          - hostPort      = 8125
                          - protocol      = "udp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-2:410965620680:parameter/terraform/prd/DATADOG_API_KEY"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
              - {
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - config-file-type        = "file"
                          - config-file-value       = "/fluent-bit/configs/parse-json.conf"
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "amazon/aws-for-fluent-bit:stable"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "api-media-stage-logs"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "core"
                        }
                    }
                  - memoryReservation     = 100
                  - mountPoints           = []
                  - name                  = "jfp-api-media-stage-log-router"
                  - portMappings          = []
                  - systemControls        = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "jfp-api-media-stage" -> (known after apply)
      ~ revision                 = 44 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.stage.module.api-media.module.ecs-task.aws_ssm_parameter.parameters["MEDIA_TRANSCODER_TASK_DEFINITION"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/api-media/stage/MEDIA_TRANSCODER_TASK_DEFINITION"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "MEDIA_TRANSCODER_TASK_DEFINITION"
        }
      + tags_all       = {
          + "name" = "MEDIA_TRANSCODER_TASK_DEFINITION"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_cloudwatch_log_group.ecs_cw_log_group will be created
+ resource "aws_cloudwatch_log_group" "ecs_cw_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "media-transcoder-stage-logs"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ecr_lifecycle_policy.ecr_policy will be created
+ resource "aws_ecr_lifecycle_policy" "ecr_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire more than 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "jfp-media-transcoder-stage"
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ecr_repository.ecr_repository will be created
+ resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "jfp-media-transcoder-stage"
      + region               = "us-east-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ecs_task_definition.ecs_task_definition will be created
+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::410965620680:role/jfp-ecs-task-execution-role"
      + family                   = "jfp-media-transcoder-stage"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + track_latest             = false
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["CLOUDFLARE_R2_ACCESS_KEY_ID"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/stage/CLOUDFLARE_R2_ACCESS_KEY_ID"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "CLOUDFLARE_R2_ACCESS_KEY_ID"
        }
      + tags_all       = {
          + "name" = "CLOUDFLARE_R2_ACCESS_KEY_ID"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["CLOUDFLARE_R2_BUCKET"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/stage/CLOUDFLARE_R2_BUCKET"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "CLOUDFLARE_R2_BUCKET"
        }
      + tags_all       = {
          + "name" = "CLOUDFLARE_R2_BUCKET"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["CLOUDFLARE_R2_ENDPOINT"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/stage/CLOUDFLARE_R2_ENDPOINT"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "CLOUDFLARE_R2_ENDPOINT"
        }
      + tags_all       = {
          + "name" = "CLOUDFLARE_R2_ENDPOINT"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["CLOUDFLARE_R2_SECRET"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/stage/CLOUDFLARE_R2_SECRET"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "CLOUDFLARE_R2_SECRET"
        }
      + tags_all       = {
          + "name" = "CLOUDFLARE_R2_SECRET"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["REDIS_PORT"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/stage/REDIS_PORT"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "REDIS_PORT"
        }
      + tags_all       = {
          + "name" = "REDIS_PORT"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.stage.module.media-transcoder.module.ecs-task-job.aws_ssm_parameter.parameters["REDIS_URL"] will be created
+ resource "aws_ssm_parameter" "parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ecs/media-transcoder/stage/REDIS_URL"
      + overwrite      = true
      + region         = "us-east-2"
      + tags           = {
          + "name" = "REDIS_URL"
        }
      + tags_all       = {
          + "name" = "REDIS_URL"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 24 to add, 6 to change, 2 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with module.datadog.datadog_integration_aws.sandbox,
│   on modules/aws/datadog/main.tf line 118, in resource "datadog_integration_aws" "sandbox":
│  118: resource "datadog_integration_aws" "sandbox" {
│ 
│ **This resource is deprecated - use the `datadog_integration_aws_account`
│ resource instead**:
│ https://registry.terraform.io/providers/DataDog/datadog/latest/docs/resources/integration_aws_account
╵
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/datadog.datadog_log_forwarder/modules/log_forwarder/main.tf line 2, in locals:
│    2:   bucket_name = var.bucket_name != "" ? var.bucket_name : "datadog-forwarder-${data.aws_caller_identity.current.account_id}-${data.aws_region.current.name}"
│ 
│ The attribute "name" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and 2 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infrastructure
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.central.jesusfilm.org/lock?id=JesusFilm%252Fcore%252Finfrastructure%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infrastructure
  ```

**Note: Objects have changed outside of Terraform**
Plan: 24 to add, 6 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```